Revit 2024 API
SpatialFieldPrimitiveHideMode Enumeration
 Defines modes which can be used by a SpatialFieldPrimitive to hide the original referenced element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Since: 2013
Syntax
C#
public enum SpatialFieldPrimitiveHideMode
Visual Basic
Public Enumeration SpatialFieldPrimitiveHideMode
Visual C++
public enum class SpatialFieldPrimitiveHideMode
Members
Member name | Description
Default |  For ColoredSurface display style, hide only the referenced face passed at the primitive creation time. For DeformedShape display style, hide only the referenced face or curve passed at the primitive creation time.
HideNone |  Do not hide any piece of the original model element.
HideOnlyReference |  Hide only the referenced face or curve.
HideWholeElement |  Hide the whole referenced element.
See Also
Autodesk.Revit.DB.Analysis Namespace